In [3]:
import pandas as pd

# pandas with titanic_dataset.csv

#### csv 파일 읽어들이기

In [4]:
titanic = pd.read_csv('titanic_dataset.csv')

#### 앞의 10개 출력

In [5]:
titanic.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

#### 뒤의 10개 출력

In [6]:
titanic.tail(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1299,3,0,"Yasbeck, Mr. Antoni",male,27.0,1,0,2659,14.4542,NaN,C,C,NaN,NaN
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN
1302,3,0,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3,0,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C,NaN,NaN,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

### Column
* pclass : Ticket class(1 == 1st, 2 == 2nd,,,)
* survived : 0 == No, 1 == yes
* name : Name
* sex : {'male', 'female'}
* age : Age
* sibsp : # of siblings / spouses aboard the Titanic
* parch : # of parents / chilren aboard the Titanic
* ticket : Ticket number
* cabin : Cabin number(객실번호)
* embarked : Port of Embarkation (C == Cherbourg, Q = Queenstown,,,)
* boat : boat # of survived passengers

#### value_counts()

In [7]:
titanic.pclass.value_counts()

3    709
1    323
2    277
Name: pclass, dtype: int64

In [8]:
titanic.survived.value_counts()

0    809
1    500
Name: survived, dtype: int64

In [9]:
print(titanic.sex.value_counts())

male      843
female    466
Name: sex, dtype: int64

#### projection

* column 을 추출_DataFrame 유지

In [10]:
titanic[['boat']].head(10)

  boat
0    2
1   11
2  NaN
3  NaN
4  NaN
5    3
6   10
7  NaN
8    D
9  NaN

* 열을 추출_DataFrame 은 파괴

In [11]:
titanic.boat.head(10)

0      2
1     11
2    NaN
3    NaN
4    NaN
5      3
6     10
7    NaN
8      D
9    NaN
Name: boat, dtype: object

In [12]:
titanic[titanic.notnull()]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

### selection

In [13]:
titanic[(titanic[['age']]>0.0) & (titanic[['age']]<=12)][['age']].dropna(axis=0)

          age
1      0.9167
2      2.0000
54    11.0000
94     4.0000
273    6.0000
...       ...
1240   0.4167
1256   7.0000
1257   9.0000
1263  11.5000
1265  10.0000

[94 rows x 1 columns]

### null(NaN)
* NaN 값은 float 자료형에서만 계산가능

#### notnull()

In [14]:
titanic[['boat']].notnull()

       boat
0      True
1      True
2     False
3     False
4     False
...     ...
1304  False
1305  False
1306  False
1307  False
1308  False

[1309 rows x 1 columns]

#### isnull()

In [15]:
titanic[['boat']].isnull()

       boat
0     False
1     False
2      True
3      True
4      True
...     ...
1304   True
1305   True
1306   True
1307   True
1308   True

[1309 rows x 1 columns]

#### dropna(axis= #)

In [16]:
titanic.dropna(axis=0)

Empty DataFrame
Columns: [pclass, survived, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, boat, body, home.dest]
Index: []

In [17]:
titanic.dropna(axis=1)

,pclass,survived,name,sex,sibsp,parch,ticket
0,1,1,"Allen, Miss. Elisabeth Walton",female,0,0,24160
1,1,1,"Allison, Master. Hudson Trevor",male,1,2,113781
2,1,0,"Allison, Miss. Helen Loraine",female,1,2,113781
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,1,2,113781
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,1,2,113781
...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,1,0,2665
1305,3,0,"Zabour, Miss. Thamine",female,1,0,2665
1306,3,0,"Zakarian, Mr. Mapriededer",male,0,0,2656
1307,3,0,"Zakarian, Mr. Ortin",male,0,0,2670
1308,3,0,"Zimmerman, Mr. Leo",male,0,0,315082

#### Find mean fare that the first class passengers paid
* unpaid passengers are out of consideration

In [18]:
titanic[(titanic.pclass == 1) & (titanic.fare > 0)][['fare']].mean()

fare    89.447482
dtype: float64

In [19]:
print("fare mean except unpaid passenger : {0: .2f}".format(titanic[(titanic.pclass == 1) & (titanic.fare > 0)].fare.mean()))

fare mean except unpaid passenger :  89.45

#### Find the names who paid the highest fare with survived or not

In [20]:
titanic[titanic.fare == titanic.fare.max()][['fare','name', 'survived']]

         fare                                               name  survived
49   512.3292                 Cardeza, Mr. Thomas Drake Martinez         1
50   512.3292  Cardeza, Mrs. James Warburton Martinez (Charlo...         1
183  512.3292                             Lesurer, Mr. Gustave J         1
302  512.3292                                   Ward, Miss. Anna         1

#### Find the names who paid the lowest fare with survived or not
* fare > 0

In [21]:
titanic[(titanic.fare > 0)].fare.min() #selection & projection

3.1708

In [22]:
titanic[(titanic.fare == titanic[titanic.fare > 0].fare.min())][['fare','name', 'survived']]

        fare                       name  survived
1082  3.1708  Olsen, Master. Artur Karl         1

#### Find the survival ratio of the passengers who paid more than 0 and less than or equal to the mean fare of third class

In [23]:
titanic[(titanic.fare > 0) & (titanic.fare <= titanic[titanic.pclass == 3].fare.mean())].survived.value_counts()

0    451
1    153
Name: survived, dtype: int64

In [24]:
len(titanic[(titanic.fare > 0) & (titanic.fare <= titanic[titanic.pclass == 3].fare.mean())].survived)

604

In [25]:
whole = len(titanic[(titanic.fare > 0) & (titanic.fare <= titanic[titanic.pclass == 3].fare.mean())].survived)
survived_not = titanic[(titanic.fare > 0) & (titanic.fare <= titanic[titanic.pclass == 3].fare.mean())].survived.value_counts()[0]
survived = titanic[(titanic.fare > 0) & (titanic.fare <= titanic[titanic.pclass == 3].fare.mean())].survived.value_counts()[1]
ratio = survived / whole * 100

In [26]:
print("The ratio : {0: .2f}%".format(ratio))

The ratio :  25.33%

#### Find the survival ratio of the passengers who paid more than the mean fare of first class

In [27]:
titanic[titanic.fare > titanic[titanic.pclass == 1].fare.mean()].survived.value_counts()

1    70
0    27
Name: survived, dtype: int64

In [28]:
len(titanic[titanic.fare > titanic[titanic.pclass == 1].fare.mean()].survived)

97

In [29]:
whole =len(titanic[titanic.fare > titanic[titanic.pclass == 1].fare.mean()].survived)
survived_not = titanic[titanic.fare > titanic[titanic.pclass == 1].fare.mean()].survived.value_counts()[0]
survived = titanic[titanic.fare > titanic[titanic.pclass == 1].fare.mean()].survived.value_counts()[1]
ratio = survived / whole * 100

In [30]:
print("The ratio : {0: .2f}%".format(ratio))

The ratio :  72.16%

#### Find the number of passengers by passenger's title

* apply() with lambda

In [68]:
get_passengers_title = lambda x: x.split(',')[1].split('.')[0].split(' ')[-1] + '.'

titanic.name.apply(get_passengers_title).value_counts()

Mr.          757
Miss.        260
Mrs.         197
Master.       61
Rev.           8
Dr.            8
Col.           4
Mlle.          2
Ms.            2
Major.         2
Capt.          1
Sir.           1
Dona.          1
Jonkheer.      1
Countess.      1
Don.           1
Mme.           1
Lady.          1
Name: name, dtype: int64